app/Controllers/HorariosController.php

    public function index()
    {
        $session = \Config\Services::session();

        if (!$session->has('id')) {
            return redirect()->to(base_url('login'));
        }

        $usuarioId = $session->get('id');

        $horarios = $this->horariosModel->where('usuario_id', $usuarioId)->findAll();
---
SELECT *
FROM `horarios`
WHERE `usuario_id` IS NULL

    public function configuracion($id)
    {
        $session = \Config\Services::session();

        if (!$session->has('id')) {
            return redirect()->to(base_url('login'));
        }

        // Obtener el diseño específico por ID
        $diseno = $this->disenoModel->find($id);

        if (!$diseno) {
            log_message('error', 'Diseño no encontrado con ID: ' . $id);
            return redirect()->to(base_url('irainicio'))->with('error', 'Diseño no encontrado');
        }

        // Verificar que el diseño pertenece al usuario actual
        if ($diseno['usuario_id'] != $session->get('id')) {
---
SELECT *
FROM `disenos`
WHERE `disenos`.`id_diseno` = '81'

        log_message('debug', '=== FIN DATOS DEL DISEÑO ===');

        // Obtener horarios existentes si los hay
        $horarios = $this->horariosModel->where('diseno_id', $id)->first();
---
SELECT *
FROM `horarios`
WHERE `diseno_id` = '81'
 LIMIT 1

    public function guardar()
    {
        $session = \Config\Services::session();

        if (!$session->has('id')) {
            return redirect()->to(base_url('login'));
        }

        $disenoId = $this->request->getPost('diseno_id');
        $diseno = $this->disenoModel->find($disenoId);
---
SELECT *
FROM `disenos`
WHERE `disenos`.`id_diseno` = '81'


        try {
            // Verificar si ya existe un horario para este diseño
            $horarioExistente = $this->horariosModel->where('diseno_id', $disenoId)->first();
---
SELECT *
FROM `horarios`
WHERE `diseno_id` = '81'
 LIMIT 1

                $this->horariosModel->update($horarioExistente['idhorario'], $datos);
            } else {
                // Crear nuevo horario
                $this->horariosModel->insert($datos);
---
INSERT INTO `horarios` (`diseno_id`, `usuario_id`, `ventana_apertura`, `ventana_cierre`, `cortina_apertura`, `cortina_cierre`, `postigon_apertura`, `postigon_cierre`, `created_at`, `updated_at`) VALUES ('81', '15', '12:24', '04:59', '12:23', '23:54', '03:47', '06:59', '2025-04-07 18:11:53', '2025-04-07 18:11:53')