app/Controllers/HorariosController.php

    public function index()
    {
        $session = \Config\Services::session();
        if (!$session->has('id')) return redirect()->to(base_url('login'));
        $usuarioId = $session->get('id');

        try {
            $horarios = $this->horariosModel->where('usuario_id', $usuarioId)->orderBy('idhorario', 'DESC')->findAll();
            $data = [
                'title' => 'Página de Inicio',
                'horarios' => $horarios,
                'usuario_id' => $usuarioId,
                'nombre_usuario' => $session->get('nombre')
            ];
---
SELECT *
FROM `horarios`
WHERE `horarios`.`idhorario` = '11'

    public function guardar()
    {
        $session = \Config\Services::session();
        if (!$session->has('id')) return redirect()->to(base_url('login'));
        $idhorario = $this->request->getPost('idhorario');
        $usuarioId = $session->get('id');

        $horarioExistente = !empty($idhorario)
            ? $this->horariosModel->where('idhorario', $idhorario)->where('usuario_id', $usuarioId)->first()
---
SELECT *
FROM `horarios`
WHERE `horarios`.`idhorario` = '11'